In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df['first'] + ' ' + df['last']  # Combine 2 columns

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df['Full Name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first     last                    email      Full Name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [9]:
df.drop(columns = ['first', 'last'], inplace=True)

In [10]:
df

                     email      Full Name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [12]:
df['Full Name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [13]:
df[['first' , 'last']] = df['Full Name'].str.split(' ', expand=True)

In [14]:
df

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [15]:
df.append({'first': 'Tony'}, ignore_index=True)

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [16]:
people = {
    "first": ["I", 'S', 'D'], 
    "last": ["IronMan", 'Batman', 'Joker'], 
    "email": ["IronMan@gmailll.com", 'Bat@dc.com', 'DJoker@dc.com']
}

df2 = pd.DataFrame(people)

In [17]:
df2

  first     last                email
0     I  IronMan  IronMan@gmailll.com
1     S   Batman           Bat@dc.com
2     D    Joker        DJoker@dc.com

In [18]:
df.append(df2, ignore_index=True)

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      IronMan@gmailll.com            NaN      I  IronMan
4               Bat@dc.com            NaN      S   Batman
5            DJoker@dc.com            NaN      D    Joker

In [19]:
df = df.append(df2, ignore_index=True)

In [20]:
df

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      IronMan@gmailll.com            NaN      I  IronMan
4               Bat@dc.com            NaN      S   Batman
5            DJoker@dc.com            NaN      D    Joker

In [21]:
df = df.drop(index=3)

In [22]:
df

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4               Bat@dc.com            NaN      S   Batman
5            DJoker@dc.com            NaN      D    Joker

In [25]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)  #Removes data of rows with specified query by specifying index

                     email      Full Name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
4               Bat@dc.com            NaN      S   Batman
5            DJoker@dc.com            NaN      D    Joker